Revit 2024 API
FabricationPart.HangerRodKit Property
 Specifies whether an ancillary kit is being used to override support rods, bolts and clips, if any. A value of 0 indicates no override is being used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public int HangerRodKit { get; set; }
Visual Basic
Public Property HangerRodKit As Integer
	Get
	Set
Visual C++
public:
property int HangerRodKit {
	int get ();
	void set (int value);
}
Remarks
 For hangers only. Setting an invalid hanger rod kit will result in the property being unchanged.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace